Revit 2024 API
CategoryNameMap.ReverseIterator Method
Retrieve a backward moving iterator to the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual CategoryNameMapIterator ReverseIterator()
Visual Basic
Public Overridable Function ReverseIterator As CategoryNameMapIterator
Visual C++
public:
virtual CategoryNameMapIterator^ ReverseIterator()
Return Value
Returns a backward moving iterator to the map.
See Also
CategoryNameMap Class
Autodesk.Revit.DB Namespace